user_tutorial/thermFluidStructOptFoam/thermFluidStructOpt_3D_180deg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale					0.001;
mergeType				points;
checkFaceCorrespondence false;

vertices
(
    (  0.0	  0.0	 0.0)	// 00
    ( 50.0	  0.0	 0.0)	// 01
    ( 50.0	 50.0	 0.0)	// 02
    (  0.0	 50.0	 0.0)	// 03
    (  0.0	  0.0	25.0)	// 04
    ( 50.0	  0.0	25.0)	// 05
    ( 50.0	 50.0	25.0)	// 06
    (  0.0	 50.0	25.0)	// 07
    (  0.0	-25.0	 0.0)	// 08
    ( 50.0	-25.0	 0.0)	// 09
    (  0.0	-25.0	25.0)	// 10
    ( 50.0	-25.0	25.0)	// 11
    ( 50.0	 75.0	 0.0)	// 12
    (  0.0	 75.0	 0.0)	// 13
    ( 50.0	 75.0	25.0)	// 14
    (  0.0	 75.0	25.0)	// 15
    (  0.0	-25.0	50.0)	// 16
    ( 50.0	-25.0	50.0)	// 17
    ( 50.0	  0.0	50.0)	// 18
    (  0.0	  0.0	50.0)	// 19
    ( 50.0	 50.0	50.0)	// 20
    (  0.0	 50.0	50.0)	// 21
    ( 50.0	 75.0	50.0)	// 22
    (  0.0	 75.0	50.0)	// 23
    ( 50.0	-50.0	 0.0)	// 24
    (450.0	-50.0	 0.0)	// 25
    (450.0	-25.0	 0.0)	// 26
    ( 50.0	-50.0	25.0)	// 27
    (450.0	-50.0	25.0)	// 28
    (450.0	-25.0	25.0)	// 29
    (450.0	  0.0	 0.0)	// 30
    (450.0	  0.0	25.0)	// 31
    (450.0	 50.0	 0.0)	// 32
    (450.0	 50.0	25.0)	// 33
    (450.0	 75.0	 0.0)	// 34
    (450.0	 75.0	25.0)	// 35
    (450.0	100.0	 0.0)	// 36
    ( 50.0	100.0	 0.0)	// 37
    (450.0	100.0	25.0)	// 38
    ( 50.0	100.0	25.0)	// 39
    ( 50.0	-50.0	50.0)	// 40
    (450.0	-50.0	50.0)	// 41
    (450.0	-25.0	50.0)	// 42
    (450.0	  0.0	50.0)	// 43
    (450.0	 50.0	50.0)	// 44
    (450.0	 75.0	50.0)	// 45
    (450.0	100.0	50.0)	// 46
    ( 50.0	100.0	50.0)	// 47
    ( 50.0	-50.0	75.0)	// 48
    (450.0	-50.0	75.0)	// 49
    (450.0	-25.0	75.0)	// 50
    ( 50.0	-25.0	75.0)	// 51
    (450.0	  0.0	75.0)	// 52
    ( 50.0	  0.0	75.0)	// 53
    (450.0	 50.0	75.0)	// 54
    ( 50.0	 50.0	75.0)	// 55
    (450.0	 75.0	75.0)	// 56
    ( 50.0	 75.0	75.0)	// 57
    (450.0	100.0	75.0)	// 58
    ( 50.0	100.0	75.0)	// 59
    (500.0	-25.0	 0.0)	// 60
    (500.0	  0.0	 0.0)	// 61
    (500.0	-25.0	25.0)	// 62
    (500.0	  0.0	25.0)	// 63
    (500.0	 50.0	 0.0)	// 64
    (500.0	 75.0	 0.0)	// 65
    (500.0	 50.0	25.0)	// 66
    (500.0	 75.0	25.0)	// 67
    (500.0	-25.0	50.0)	// 68
    (500.0	  0.0	50.0)	// 69
    (500.0	 50.0	50.0)	// 70
    (500.0	 75.0	50.0)	// 71
);

blocks
(
    // Inlet Layer
    // -> Inlet
    hex ( 0  1  2  3  4  5  6  7) zone_fluid	  ( 21 21 11) simpleGrading (1 1 1) // 00

    // -> Sublayer 1
    hex ( 8  9  1  0 10 11  5  4) zone_solid	  ( 21 11 11) simpleGrading (1 1 1) // 01
    hex ( 3  2 12 13  7  6 14 15) zone_solid	  ( 21 11 11) simpleGrading (1 1 1) // 02

    // -> Sublayer 2
    hex (10 11  5  4 16 17 18 19) zone_solid	  ( 21 11 11) simpleGrading (1 1 1) // 03
    hex ( 4  5  6  7 19 18 20 21) zone_solid	  ( 21 21 11) simpleGrading (1 1 1) // 04
    hex ( 7  6 14 15 21 20 22 23) zone_solid	  ( 21 11 11) simpleGrading (1 1 1) // 05


    // Body Layer
    // -> Sublayer 1
    hex (24 25 26  9 27 28 29 11) zone_opt		  (161 11 11) simpleGrading (1 1 1) // 06
    hex ( 9 26 30  1 11 29 31  5) zone_test_solid (161 11 11) simpleGrading (1 1 1) // 07
    hex ( 1 30 32  2  5 31 33  6) zone_test_fluid (161 21 11) simpleGrading (1 1 1) // 08
    hex ( 2 32 34 12  6 33 35 14) zone_test_solid (161 11 11) simpleGrading (1 1 1) // 09
    hex (12 34 36 37 14 35 38 39) zone_opt		  (161 11 11) simpleGrading (1 1 1) // 10

    // -> Sublayer 2
    hex (27 28 29 11 40 41 42 17) zone_opt		  (161 11 11) simpleGrading (1 1 1) // 11
    hex (11 29 31  5 17 42 43 18) zone_test_solid (161 11 11) simpleGrading (1 1 1) // 12
    hex ( 5 31 33  6 18 43 44 20) zone_test_solid (161 21 11) simpleGrading (1 1 1) // 13
    hex ( 6 33 35 14 20 44 45 22) zone_test_solid (161 11 11) simpleGrading (1 1 1) // 14
    hex (14 35 38 39 22 45 46 47) zone_opt		  (161 11 11) simpleGrading (1 1 1) // 15

    // -> Sublayer 3
    hex (40 41 42 17 48 49 50 51) zone_opt		  (161 11 11) simpleGrading (1 1 1) // 16
    hex (17 42 43 18 51 50 52 53) zone_opt		  (161 11 11) simpleGrading (1 1 1) // 17
    hex (18 43 44 20 53 52 54 55) zone_opt		  (161 21 11) simpleGrading (1 1 1) // 18
    hex (20 44 45 22 55 54 56 57) zone_opt		  (161 11 11) simpleGrading (1 1 1) // 19
    hex (22 45 46 47 57 56 58 59) zone_opt		  (161 11 11) simpleGrading (1 1 1) // 20


    // Outlet Layer
    // -> Sublayer 1
    hex (26 60 61 30 29 62 63 31) zone_solid	  ( 21 11 11) simpleGrading (1 1 1) // 21
    hex (32 64 65 34 33 66 67 35) zone_solid	  ( 21 11 11) simpleGrading (1 1 1) // 22

    // -> Sublayer 2
    hex (29 62 63 31 42 68 69 43) zone_solid	  ( 21 11 11) simpleGrading (1 1 1) // 23
    hex (31 63 66 33 43 69 70 44) zone_solid	  ( 21 21 11) simpleGrading (1 1 1) // 24
    hex (33 66 67 35 44 70 71 45) zone_solid	  ( 21 11 11) simpleGrading (1 1 1) // 25

    // -> Outlet
    hex (30 61 64 32 31 63 66 33) zone_fluid	  ( 21 21 11) simpleGrading (1 1 1) // 26
);

edges
(
    
);

boundary
(
    force_out
    {
        type patch;
        faces
        (
            (62 60 61 63)
            (66 64 65 67)
            (68 62 63 69)
            (69 63 66 70)
            (70 66 67 71)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (10 11  9  8)
            (15 14 12 13)
            (16 17 18 19)
            (16 17 11 10)
            (19 18 20 21)
            (23 22 14 15)
            (21 20 22 23)
            (27 24  9 11)
            (28 25 26 29)
            (39 38 36 37)
            (14 12 37 39)
            (35 34 36 38)
            (40 27 11 17)
            (41 28 29 42)
            (22 14 39 47)
            (45 35 38 46)
            (47 46 38 39)
            (48 49 50 51)
            (48 40 17 51)
            (49 41 42 50)
            (51 50 52 53)
            (51 17 18 53)
            (50 42 43 52)
            (53 52 54 55)
            (53 18 20 55)
            (52 43 44 54)
            (55 54 56 57)
            (55 20 22 57)
            (54 44 45 56)
            (57 56 58 59)
            (57 22 47 59)
            (56 45 46 58)
            (59 58 46 47)
            (29 62 60 26)
            (35 67 65 34)
            (42 68 62 29)
            (42 68 69 43)
            (43 69 70 44)
            (45 71 67 35)
            (44 70 71 45)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (63 61 64 66)
        );
    }

    force_in
    {
        type patch;
        faces
        (
            (10  8  0  4)
            ( 7  3 13 15)
            (16 10  4 19)
            (19  4  7 21)
            (21  7 15 23)
        );
    }

    sym
    {
        type symmetry;
        faces
        (
            ( 0  1  2  3)
            ( 8  9  1  0)
            ( 3  2 12 13)
            (24 25 26  9)
            ( 9 26 30  1)
            ( 1 30 32  2)
            ( 2 32 34 12)
            (12 34 36 37)
            (26 60 61 30)
            (32 64 65 34)
            (30 61 64 32)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            ( 4  0  3  7)
        );
    }

    ad_walls
    {
        type wall;
        faces
        (
            (27 28 25 24)
            (40 41 28 27)
            (48 49 41 40)
        );
    }
);

mergePatchPairs
();

faces
();

// ************************************************************************* //
