user_tutorial/thermFluidStructOptFoam/thermFluidStructOpt_3D_180deg/0/U_adj_T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U_adj_T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	inlet
    {
		type            fixedValue;
        value           uniform (0 0 0); // Always (0, 0, 0)
    }

    outlet
    {
        type            adjointOutletVelocityHeat;
        value           uniform (0 0 0);
    }

    walls
    {
        type            noSlip;
    }

    force_out
    {
        type            noSlip;
    }

    force_in
    {
        type            noSlip;
    }
    
    ad_walls
    {
        type            noSlip;
    }
    
    sym
    {
        type            symmetry;
    }
}

// ************************************************************************* //
