user_tutorial/thermFluidStructOptFoam/thermFluidStructOpt_3D_180deg/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 353.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 353.15;
    }

    outlet
    {
        type            zeroGradient;   
    }

    walls
    {
        type            fixedValue;
        value           uniform 293.15;  
    }

    force_out
    {
        type            zeroGradient;   
    } 

    force_in
    {
        type            zeroGradient;   
    } 
    
    ad_walls
    {
        type            zeroGradient;
    }
    
    sym
    {
        type            symmetry;
    }
}

// ************************************************************************* //
