user_tutorial/thermFluidStructOptFoam/thermFluidStructOpt_3D_180deg/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  | Upwind grad(Ta)                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes
{
    default         steadyState;
}

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(D)         leastSquares;
    grad(T)         leastSquares;
    grad(Da)        leastSquares;
    grad(T_adj)     leastSquares;
}

divSchemes
{
    default								Gauss linear;

    div(phi,U)							bounded Gauss upwind;
    div(-phi,U_adj_U)					bounded Gauss upwind;
    div(-phi,U_adj_T)					bounded Gauss upwind;
    div(phi,T)							Gauss linearUpwind grad(T);
    div(-phi,T_adj)						Gauss linearUpwind grad(T_adj);
    div((nuEff*dev2(T(grad(U)))))		Gauss linear;
    div((nuEff*dev2(T(grad(U_adj_U)))))	Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
    p_adj_U;
    p_adj_T;
    D;
    Da;
}

// ************************************************************************* //
